create table body (
    id serial primary key,
    name varchar not null,
    category_id int not null REFERENCES category(id)
);

INSERT INTO body (name, category_id)
VALUES ('Внедорожник', 1), ('Седан', 1), ('Хэтчбек', 1), ('Лифтбек', 1),
       ('Универсал', 1), ('Минивэн', 1), ('Купе', 1), ('Пикап', 1),
       ('Кабриолет', 1), ('Фургон', 1),
       ('Легкие коммерческие', 2), ('Грузовики', 2), ('Седельные тягачи', 2),
       ('Автобусы', 2), ('Прицепы и полуприцепы', 2),
       ('Сельскохозяйственная', 3), ('Строительная и дорожная', 3),
       ('Погрузчики', 3), ('Автокраны', 3), ('Экскаваторы', 3),
       ('Бульдозеры', 3), ('Коммунальная', 3),
       ('Мотоциклы', 4), ('Скутеры', 4), ('Мотовездеходы', 4), ('Снегоходы', 4);